app/views/events/show.html.erb

SELECT "payments".* FROM "payments" WHERE "payments"."event_id" = ?  [["event_id", 4]]
---
    <div class="row placeholders">
     <% @event.payments.each do |payment| %>