app/controllers/events_controller.rb

SELECT "events".* FROM "events"  ORDER BY created_at DESC
---
  def index
    @events = Event.order("created_at DESC")

INSERT INTO "events" ("event_name", "location", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["event_name", "twe"], ["location", "oih"], ["user_id", 2], ["created_at", "2016-09-20 20:12:33.911357"], ["updated_at", "2016-09-20 20:12:33.911357"]]
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
     if @event.save!